{
  "professional": [
    {
      "title": "Data Engineer",
      "company": "Johnson & Johnson",
      "duration": "February 2023 — January 2024",
      "location": "São Paulo, Brazil",
      "responsibilities": [
        "Development and maintenance of an information and services website for use by medical professionals in all Latin American countries. Using regression and integration tests through Cypress and Jenkins, enabling uninterrupted development and delivery of the product.",
        "Monitoring and classifying of thousands of users across related products, using the Google and Microsoft suite of tools (Power BI, Tag Manager, Analytics, Data Studio), in order to label and categorize usage patterns in order to improve the end-user experience.",
        "Design of new dashboards, enabling better monitoring and decision-making for the multiple teams involved in the project. As well as the creation of technical documentation for dashboards containing crucial information for the understanding of new consumers of such metrics.",
        "Effective and continuous communication with different teams from different countries, showing the ability to communicate in English on both technical and business level subjects."
      ]
    },
    {
      "title": "Machine Learning Researcher",
      "company": "Embraer & CNPq",
      "duration": "May 2022 — December 2023",
      "location": "São Paulo, Brazil",
      "responsibilities": [
        "Study and comparative analysis of puzzle solving methods using machine learning and computer vision approaches. Implementation carried out primarily in Python, PyTorch, OpenCV and NumPy. Continuous research on the subject over the course of years, implementing a novel algorithm not yet present in the literature. Subsequently publishing an article in the field.",
        "Development of an innovative solution to the manual problem of choosing the quantity and shape of aircraft parts to be baked in an industrial oven, as well as the time and temperature levels to be used during the process."
      ]
    }
  ],
  "academic": [
    {
      "title": "B.Sc. in Computer Engineering",
      "company": "Universidade Federal de São Paulo (Unifesp)",
      "duration": "March 2019 — December 2023",
      "location": "São Paulo, Brazil",
      "responsibilities": []
    },
    {
      "title": "B.Sc. in Science and Technology",
      "company": "Universidade Federal de São Paulo (Unifesp)",
      "duration": "March 2019 — February 2022",
      "location": "São Paulo, Brazil",
      "responsibilities": []
    }
  ],
  "volunteer": [
    {
      "title": "Game Designer",
      "company": "CEGI — Universidade Federal de São Paulo (Unifesp)",
      "duration": "November 2020 — February 2023",
      "location": "São Paulo, Brazil",
      "responsibilities": [
        "Design and development of multiple educational games made for public schools by the extension program group at Unifesp, CEGI (Center for Games and Internet Studies)."
      ]
    }
  ]
}
